In [1]:
import pandas as pd
import matplotlib.pyplot as plt 
import numpy as np

In [2]:
series=pd.Series(["apple","mango","orange","banana","pear"])
series

0     apple
1     mango
2    orange
3    banana
4      pear
dtype: object

In [3]:
fruits=series
colors=pd.Series(['red','blue','green','yellow','maroon'])

In [4]:
fruits

0     apple
1     mango
2    orange
3    banana
4      pear
dtype: object

In [5]:
colors

0       red
1      blue
2     green
3    yellow
4    maroon
dtype: object

In [6]:
DataF=pd.DataFrame({"fruits":fruits,
                    "colors":colors})
DataF

   fruits  colors
0   apple     red
1   mango    blue
2  orange   green
3  banana  yellow
4    pear  maroon

In [8]:
loaded_csv=pd.read_csv("car-sales.csv")
loaded_csv.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [9]:
loaded_csv.to_csv("saved_loaded.csv")

In [11]:
data_from_url_air_quality=pd.read_csv("http://raw.githubusercontent.com/FairozAhmadSheikh/Datasets_CSV/refs/heads/main/Air%20Quality%20Missing%20Data.csv")
data_from_url_air_quality.head()

         Date  Ozone  Solar  Wind  Temp
0  01-05-1976   41.0  190.0   7.4    67
1  02-05-1976   36.0  118.0   8.0    72
2  03-05-1976   12.0  149.0  12.6    74
3  04-05-1976   18.0  313.0  11.5    62
4  05-05-1976    NaN    NaN  14.3    56

# Attributes and Functions
Attributes : are metadata

Functions :  perform some steps

In [12]:
# Attributes
data_from_url_air_quality.columns

Index(['Date', 'Ozone', 'Solar', 'Wind', 'Temp'], dtype='object')

In [13]:
data_from_url_air_quality.index

RangeIndex(start=0, stop=153, step=1)

In [14]:
data_from_url_air_quality.dtypes

Date      object
Ozone    float64
Solar    float64
Wind     float64
Temp       int64
dtype: object

In [15]:
#Functions
data_from_url_air_quality.describe()

            Ozone       Solar        Wind        Temp
count  116.000000  146.000000  153.000000  153.000000
mean    42.129310  185.931507    9.957516   77.882353
std     32.987885   90.058422    3.523001    9.465270
min      1.000000    7.000000    1.700000   56.000000
25%     18.000000  115.750000    7.400000   72.000000
50%     31.500000  205.000000    9.700000   79.000000
75%     63.250000  258.750000   11.500000   85.000000
max    168.000000  334.000000   20.700000   97.000000

In [17]:
data_from_url_air_quality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    153 non-null    object
 1   Ozone   116 non-null    float64
 2   Solar   146 non-null    float64
 3   Wind    153 non-null    float64
 4   Temp    153 non-null    int64
dtypes: float64(3), int64(1), object(1)
memory usage: 6.1+ KB

In [19]:
data_from_url_air_quality['Wind'].mean()

np.float64(9.957516339869281)

In [20]:
data_from_url_air_quality.sum()

Date     01-05-197602-05-197603-05-197604-05-197605-05-...
Ozone                                               4887.0
Solar                                              27146.0
Wind                                                1523.5
Temp                                                 11916
dtype: object

In [21]:
len(data_from_url_air_quality)

153

In [26]:
loaded_csv

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [27]:
animals=pd.Series(['cat','dog','elephant','boar','wild_boar'],index=[1,2,1,3,4])

In [28]:
animals

1          cat
2          dog
1     elephant
3         boar
4    wild_boar
dtype: object

# LOC AND ILOC
LOC => Index

iloc => Position

In [34]:
animals.loc[1]  # Finds specific index

1         cat
1    elephant
dtype: object

In [35]:
animals.iloc[1]  # gives length wise starts from 0 to n

'dog'

In [38]:
loaded_csv.loc[:3]  # last index in loc is included

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [40]:

loaded_csv.iloc[:3]  # In iloc last index is excluded

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

# Selecting columns 

two ways 
> dataframe_name.column_name

> dataframe_name['column_name]

In [41]:
loaded_csv['Make']

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [45]:
loaded_csv['Colour']

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [46]:
loaded_csv.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [56]:
data_from_url_air_quality=pd.DataFrame(data_from_url_air_quality)

In [59]:
data_from_url_air_quality

           Date  Ozone  Solar  Wind  Temp
0    01-05-1976   41.0  190.0   7.4    67
1    02-05-1976   36.0  118.0   8.0    72
2    03-05-1976   12.0  149.0  12.6    74
3    04-05-1976   18.0  313.0  11.5    62
4    05-05-1976    NaN    NaN  14.3    56
..          ...    ...    ...   ...   ...
148  26-09-1976   30.0  193.0   6.9    70
149  27-09-1976    NaN  145.0  13.2    77
150  28-09-1976   14.0  191.0  14.3    75
151  29-09-1976   18.0  131.0   8.0    76
152  30-09-1976   20.0  223.0  11.5    68

[153 rows x 5 columns]

In [61]:
data_from_url_air_quality.Wind.mean()

np.float64(9.957516339869281)

In [63]:
data_from_url_air_quality.Wind.sum()

np.float64(1523.5)

In [65]:
data_from_url_air_quality[data_from_url_air_quality['Wind']<153]

           Date  Ozone  Solar  Wind  Temp
0    01-05-1976   41.0  190.0   7.4    67
1    02-05-1976   36.0  118.0   8.0    72
2    03-05-1976   12.0  149.0  12.6    74
3    04-05-1976   18.0  313.0  11.5    62
4    05-05-1976    NaN    NaN  14.3    56
..          ...    ...    ...   ...   ...
148  26-09-1976   30.0  193.0   6.9    70
149  27-09-1976    NaN  145.0  13.2    77
150  28-09-1976   14.0  191.0  14.3    75
151  29-09-1976   18.0  131.0   8.0    76
152  30-09-1976   20.0  223.0  11.5    68

[153 rows x 5 columns]

In [67]:
data_from_url_air_quality.Solar.max()

334.0